//p136_salay3

#include <stdio.h>
#define NO 10 //임직원 수 
main()
{
	char n,i;
	char *grade[6]={"사원", "대리", "과장", "차장", "부장", "이사"};
	int salary[NO][5], sub[6][4]={{1500,200,1400,5}, {2100,300,2000,7}, {2500,500,2300,10}, {3200,600,3100,15},
								  {3700,700,3300,20}, {4500,900,4300,25}};
	char name[NO][9]; //이름  
	int code[NO]={0,0,2,1,0,5,1,2,3,4}; //직급별 코드  
	
	printf("=== 임직원 개인정보 입력 ===\n");
//	do
//	{
//		
//	}while();
	
	printf("=================================================\n");
	printf("                  9월 봉급 명세서(단위:천원)\n");
	printf("-------------------------------------------------\n");
	printf("번호  이름  직급 기본급 성과급 상여금 합계 세율 수령액\n");
	printf("-------------------------------------------------\n");
	for(n=0;n<NO;n++)
	{
		printf(" %2d %-8s %4s")	
		for(i=0;i<=2;i++)
		
	} 


}
